src/Catalogs/ШаблоныДокументов/ШаблоныДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныДокументов</name>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ШаблоныДокументов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьШаблон(Команда)

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "Шаблон Word (*.dotx)|*.dotx";
	ДиалогВыбора.Заголовок = "Выберите файл шаблона";

	Если ДиалогВыбора.Выбрать() Тогда
		ЗагрузитьШаблонНаСервере(ДиалогВыбора.ПолноеИмяФайла);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПросмотретьШаблон(Команда)

	Если НЕ ШаблонЗагруженНаСервере() Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Шаблон не загружен";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;

	ПросмотретьШаблонНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьШаблонНаСервере(Знач ПолноеИмяФайла)

	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	Объект.Шаблон = Новый ХранилищеЗначения(ДвоичныеДанные);
	ПозицияРазделителя = СтрНайти(ПолноеИмяФайла, "\", НаправлениеПоиска.СКонца);
	Объект.ИмяФайла = Сред(ПолноеИмяФайла, ПозицияРазделителя + 1);
	Объект.РазмерФайла = ДвоичныеДанные.Размер();

КонецПроцедуры

&НаСервере
Процедура ПросмотретьШаблонНаСервере()

	ДвоичныеДанные = Объект.Шаблон.Получить();
	ВременныйФайл = ПолучитьИмяВременногоФайла(".dotx");
	
	Попытка
		ДвоичныеДанные.Записать(ВременныйФайл);
		
	Исключение   
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Файл был поврежден или удален. Для продолжения работы загрузите заново.";
		СообщениеПользователю.Сообщить();
		Возврат;		
	КонецПопытки;

	ЗапуститьПриложение(ВременныйФайл);

КонецПроцедуры

&НаСервере
Функция ШаблонЗагруженНаСервере()

	Возврат Объект.Шаблон <> Неопределено;

КонецФункции

#КонецОбласти
